export default {
  message: {
    language: "العربية",
    fullName: "رزوقي ريان زين الدين",
    profession: "مطور ويب",
    location: "باتنة، الجزائر",
    phoneNumber: "+213 6 63277501",
    email: "rayan03rezougui@gmail.com",
    selfPresentation: "مرحبًا! 👋. أنا رزوقي ريان زين الدين\n مطوّر ويب قائم بباتنة",
    aboutTitle: "نبذة عني",
    summary: "مطور ويب متمرس & متخصص في الواجهة الأمامية\n مع عامين من الخبرة في تطوير الويب والشغف بصناعة حلول رقمية مبتكرة، أنا رزوقي ريان زين الدين، مطور ويب مخصص في الجزائر.\n تعكس محفظتي التزامي بالتميز.لقد نجحت في تنفيذ مشاريع مثل صفحة هبوط آسرة لشركة منازل ذكية، ولوحة متابعة لإدارة مدرسة، وتطبيق سلس لشراء الأثاث.وبينما أتفوق في تطوير الواجهة الأمامية، أنا بارع بنفس القدر في أعمال الواجهة الخلفية، وأنا أفخر بابتكار حلول متعددة الاستخدامات تغطي تطبيقات الهاتف المحمول والكمبيوتر.\n في العام الثالث من دراستي في جامعة سكيكدة في كلية علوم الحاسوب، أحافظ على عقلية موجهة نحو النمو.تتمحور منهجيتنا في الترميز حول إيجاد الحلول الأكثر كفاءة وأناقة للمشاكل المعقدة.تزدهر على الإبداع وأمتلك مهارات قوية في حل المشكلات، مما مكنني من صنع تجارب ويب فريدة وسهلة الاستخدام.\n تتضمن رؤيتي طويلة الأجل إنشاء شركتي الخاصة لتطوير الويب في الجزائر، مدفوعة بالالتزام بالمساهمة في التحول الرقمي لبلدي.أنا متعلم سريع وأشارك باستمرار في التحسين الذاتي وأبقى على اطلاع بالتقنيات الناشئة وأفضل الممارسات لضمان تقديم حلول متطورة لعملائي.\nقبل ذلك، انغمست في العالم الإبداعي كمصمم جرافيك.كان ملعبي هو Adobe Photoshop وIllustrator، مع تلميحات من Adobe Indesign لإضفاء الحيوية على أفكاري.\n وأدعوكم إلى استكشاف محفظتي ومشاهدة تفاني في تطوير الويب والسعي الدؤوب للتميز. دعونا نتعاون من أجل إضفاء الحيوية على رؤيتك الرقمية",
    spokenLanguages: { spokenLanguagesTitle: "اللغات المنطوقة", spokenLanguages: ["العربية (لغتي الأم)", "الفرنسية (طلاقة)", "الإنجليزية (متقنة)"] },
    tools: "هذه هي الأدوات التي استخدمها يوميًا",
    toolsText: { devTools: "أدوات التطوير", designTools: "أدوات التصميم" },
    workExperience:
    {
      title: "تجربة العمل",
      period: { periodTitle: "الفترة الزمنية", period: "يوليو 2023 - أغسطس 2023" },
      position: { positionTitle: "المنصب الوظيفي", position: "مطور ويب مبتدئ" },
      responsibilities: {
        responsibilitiesTitle: "المسؤوليات",
        responsibilities: {
          a: "تحويل النماذج إلى واجهات ويب وظيفية باستخدام HTML وJavaScript وCSS وVUE.",
          b: "حل المشاكل التقنية وحل مشاكل المستخدم وإصلاحها.",
          c: "الاستفادة من PHP وSQL وJavaScript لتطوير الواجهة الخلفية.",
          d: "تطبيق التقنيات الناشئة لتعزيز أداء الموقع وأهميته.",
          e: "التعاون مع فرق التسويق لتحديد أهداف المشروع ومراحله الرئيسية.",
          f: "تصميم الأطر الشبكية وخرائط المواقع وقوائم جرد المحتوى لتصاميم الويب الجديدة.",
          g: "تصميم مخططات الصفحات وخصائص التنقل التي تتجاوز توقعات المستخدم.",
          h: "استخدام جافا سكريبت والبرمجة الموجهة نحو الأشياء لتنفيذ التصميم بنجاح.",
          i: "تطوير الحلول التقنية للأصول التي يتعامل معها المستخدم.",
          j: "التفاعل مع العملاء لتحسين قابلية استخدام الموقع وحل الاستفسارات.",
          k: "إدارة تطوير الواجهة الخلفية القائمة على PHP لضمان سلامة الموقع."
        }
      }
    },
    education:
    {
      university: "جامعة 20 أوت 1955، سكيكدة، الجزائر",
    },
    projects: {
      title: "بعض المشاريع",
      message: "...سيكون الباقي متاحا قريبا"
    },
    hobbies: ["التصميم", "الرسم", "لعب الشطرنج"],
    exploreButton: "استكشاف"
  }
}